package serve

import (
	"fmt"
	"io"

	"github.com/mertcikla/tld/internal/term"
)

func PrintLogo(w io.Writer) {
	logo := `
   ░██    ░██ ░███████   ░██
   ░██    ░██ ░██   ░██
░████████ ░██ ░██    ░██ ░██ ░██████    ░████████ ░██░████  ░██████   ░█████████████
   ░██    ░██ ░██    ░██ ░██      ░██  ░██    ░██ ░███           ░██  ░██   ░██   ░██
   ░██    ░██ ░██    ░██ ░██ ░███████  ░██    ░██ ░██       ░███████  ░██   ░██   ░██
   ░██    ░██ ░██   ░██  ░██░██   ░██  ░██   ░███ ░██      ░██   ░██  ░██   ░██   ░██
    ░████ ░██ ░███████   ░██ ░█████░██  ░█████░██ ░██       ░█████░██ ░██   ░██   ░██
                                              ░██
                                        ░███████
`
	if term.IsColorEnabled(w) {
		_, _ = fmt.Fprintln(w, term.ColorBlue+logo+term.ColorReset)
	} else {
		_, _ = fmt.Fprintln(w, logo)
	}
}
